Revit 2015 API
StructuralSectionShape Enumeration
 Shapes for structural sections.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum StructuralSectionShape
Visual Basic
Public Enumeration StructuralSectionShape
Visual C++
public enum class StructuralSectionShape
Members
Member name | Description
Invalid |  This element do not support structural section.
NotDefined |  Structural section was not defined for this element
RectangleParameterized |  Defines parameters for parameterized rectangle structural sections.
PipeStandard |  Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).
IParallelFlange |  Defines parameters for I-shape Parallel Flange structural sections.
ISlopedFlange |  Defines parameters for I-shape Sloped Flange structural sections.
IWideFlange |  Defines parameters for I-shape Wide Flange structural sections.
CParallelFlange |  Defines parameters for C-channel Parallel Flange structural sections.
CSlopedFlange |  Defines parameters for C-channel Sloped Flange structural sections.
LAngle |  Defines parameters for L-angle structural sections.
RectangularBar |  Defines parameters for Rectangular Bar structural sections.
RoundBar |  Defines parameters for Round Bar structural sections.
RectangleHSS |  Defines parameters for Rectangular HSS structural sections.
RoundHSS |  Defines parameters for Round HSS structural sections.
IWelded |  Defines parameters for I-shape Welded structural sections.
ISplitParallelFlange |  Defines parameters for I-split Parallel Flange structural sections.
ISplitSlopedFlange |  Defines parameters for I-split Sloped Flange structural sections.
StructuralTees |  Defines parameters for Structural Tees structural sections.
Remarks
 Allow safely differentiate between classes inherited from Autodesk::Revit::DB::Structure::StructuralSections::StructuralSection class.
See Also
Autodesk.Revit.DB.Structure.StructuralSections Namespace